# Написати функцiю season, яка приймає один аргумент — номер мiсяця (вiд 1 до 12).
# Яка буде повертати пору року, якiй цей мiсяць належить (зима, весна, лiто або осiнь)
def season(m): 
    if m == 12 or m == 1 or m == 2:
        print("Зима")
    elif m == 3 or m == 4 or m == 5:
        print("Весна")
    elif m == 6 or m == 7 or m == 8:
        print("Літо")
    elif m == 9 or m == 10 or m == 11:
        print("Осінь")
    elif m == 0 or m > 12:
        print("Номер місяця введено не правильно.")
season(int(input("Введіть номер місяця: ")))

