#Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями
#Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї),
#пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" і при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
#Повиннi опрацювати такi умови:
#x > y      вiдповiдь - х бiльше нiж у на z
#x < y      вiдповiдь - у бiльше нiж х на z
#x == y     вiдповiдь - х дорiвнює z

x = float(input("Введіть числове значення х = "))
y = float(input("Введіть числове значення y = "))
def compare (a,b):
    if (a != b):
        subt  = a - b
        if subt > 0:
            rez = str(print(f"Число {a} більше за {b} на {subt}"))
        elif subt < 0:
            rez = str(print(f"Число {b} більше за {a} на {-subt}"))
    else:
        rez = str(print(f"Число {a} дорівнює {a}"))
    return 
(compare(x,y))
        
